app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    if params[:username]
      @user = User.where(name: params[:username]).first
      @articles = @user.articles
    else
    @articles = Article.all

INSERT INTO `articles` (`corpse`, `created_at`, `preview`, `title`, `updated_at`) VALUES ('Lorem ispum, est hierq glorum fuis', '2014-11-25 13:08:19', 'This is the first article', 'First Article', '2014-11-25 13:08:19')
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE `articles` SET `corpse` = 'Lorem ispum, est hierae glorum fuis', `updated_at` = '2014-11-25 13:12:59' WHERE `articles`.`id` = 1
---
  def update
    respond_to do |format|
      if @article.update(article_params)